Процедура УдалитьСтарыеДанные() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтборРазмещение.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОтборРазмещение КАК ОтборРазмещение
		|ГДЕ
		|	ОтборРазмещение.Дата < &ДатаСреза";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДобавитьМесяц(ТекущаяДата(), -2));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокументОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Удалить();
	КонецЦикла;
	
КонецПроцедуры