#Если МобильноеПриложениеКлиент Тогда


#Область ПрограммныйИнтерфейс

Функция ПодключитьКомпоненту() Экспорт
	Возврат ПодключитьВнешнююКомпоненту("ОбщийМакет.ComponentBroadcasts", "Broadcasts", ТипВнешнейКомпоненты.Native);
КонецФункции

Процедура СоздатьОбъектКомпонентыДляСчитыванияШтрихкодов() Экспорт
	
	ИмяСобытия = ИмяСобытияСканера();
	КомпонентыДляСчитыванияШтрихкодов = СоздатьОбъектКомпоненты();
	
	КомпонентыДляСчитыванияШтрихкодов.УстановитьПараметр("FilterName",ИмяСобытия);
	ШаблонДанных = КомпонентыДляСчитыванияШтрихкодов.ПолучитьШаблонОписанияДанных();
	barcode = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонДанных, "data", "false", "0");
	КомпонентыДляСчитыванияШтрихкодов.УстановитьПараметр("CaptureData", barcode);
	
КонецПроцедуры

Функция ИмяСобытияСканера() Экспорт
	Возврат "scan.rcv.message";
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьОбъектКомпоненты()
	Возврат Новый("AddIn.Broadcasts.UniversalBroadcast");
КонецФункции

#КонецОбласти

#КонецЕсли
	