#Если МобильноеПриложениеКлиент Тогда


#Область ПрограммныйИнтерфейс

Функция ПодключитьКомпоненту() Экспорт
	Возврат ПодключитьВнешнююКомпоненту("ОбщийМакет.ComponentBroadcasts", "Broadcasts", ТипВнешнейКомпоненты.Native);
КонецФункции

Функция СоздатьОбъектКомпонентыДляСчитыванияШтрихкодов() Экспорт
	
	ИмяСобытия = ИмяСобытияСканера();
	КомпонентыДляСчитыванияШтрихкодов = СоздатьОбъектКомпоненты();
	
	КомпонентыДляСчитыванияШтрихкодов.УстановитьПараметр("FilterName",ИмяСобытия);
	ШаблонДанных = КомпонентыДляСчитыванияШтрихкодов.ПолучитьШаблонОписанияДанных();
	barcode = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонДанных, "data", XMLСтрока(Ложь), XMLСтрока(0));
	КомпонентыДляСчитыванияШтрихкодов.УстановитьПараметр("CaptureData", barcode);
	
КонецФункции

Функция ИмяСобытияСканера() Экспорт
	Возврат "scan.rcv.message";	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьОбъектКомпоненты()
	Возврат Новый("AddIn.Broadcasts.UniversalBroadcast");	
КонецФункции

#КонецОбласти

#КонецЕсли
	