Процедура ЗарегистрироватьВводШтрихкода(Штрихкод, Знач Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Попытка
			Пользователь = ПараметрыСеанса.ТекущийПользователь;
		Исключение
			Пользователь = Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	МенЗаписи = РегистрыСведений.Сканирования.СоздатьМенеджерЗаписи();
	МенЗаписи.Период = ТекущаяДата();
	МенЗаписи.Пользователь = Пользователь;
	МенЗаписи.Штрихкод = Штрихкод;
	
	МенЗаписи.Записать(Истина);
КонецПроцедуры