Перем КомпонентыДляСчитыванияШтрихкодов Экспорт; 

Процедура ПриНачалеРаботыСистемы()
	#Если МобильноеПриложениеКлиент Тогда 
	Если РаботаСКомпонентойКлиент.ПодключитьКомпоненту() Тогда
		ДляСчитыванияШтрихкодов = РаботаСКомпонентойКлиент.СоздатьОбъектКомпонентыДляСчитыванияШтрихкодов();	
	Иначе 
		КомпонентыДляСчитыванияШтрихкодов = Неопределено;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось подключить компоненту для считывания штрихкодов!";
		Сообщение.Сообщить();	
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ЗапуститьФормуАвторизации", 0.1, Истина);
	
	#КонецЕсли
КонецПроцедуры

Процедура ПриЗавершенииРаботыСистемы()
 
 	КомпонентыДляСчитыванияШтрихкодов = Неопределено

КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	
	Если Событие = "UniversalBroadcastEvent" Тогда		

		ШтрихкодСтрока = СтроковыеФункцииКлиентСервер.ИзвлечьТекстИзHTML(Данные);
		ШтрихкодСтрока = СтрЗаменить(ШтрихкодСтрока, РаботаСКомпонентойКлиент.ИмяСобытияСканера(), "");
		Оповестить("СканШтрихкода", ШтрихкодСтрока, Источник);

	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьФормуАвторизации() Экспорт	
	
	ОткрытьФорму("ОбщаяФорма.ФормаАвторизации");
	
КонецПроцедуры