Функция ПолучитьДанныеПоШтрихкоду(Штрихкод) Экспорт
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод В(&Штрихкод)";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТекДанные = Новый Структура("Штрихкод, Номенклатура, Упаковка");
		ЗаполнитьЗначенияСвойств(ТекДанные, Выборка);
	Иначе
		ТекДанные = Неопределено;	
	КонецЕсли;
	
	Возврат ТекДанные;
КонецФункции