
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	#Если МобильноеПриложениеКлиент Тогда
		
	ОбработчикСканирования = Новый ОписаниеОповещения("СканированиеКамерой", ЭтотОбъект, Новый Структура("Источник", ПараметрыВыполненияКоманды.Источник));
	ОбработчикЗакрытияСканирования = Новый ОписаниеОповещения("ОбработкаЗакрытияСканирования", ЭтотОбъект);
	
	СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Сканирование", ОбработчикСканирования);
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СканированиеКамерой(ШтрихКод, Результат, Сообщение, ДопПарметры) Экспорт
	
	#Если МобильноеПриложениеКлиент Тогда
		СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
	#КонецЕсли
	Если Результат Тогда
		Источник = Неопределено;
		ДопПарметры.Свойство("Источник", Источник);
		Оповестить("СканШтрихкода", ШтрихКод, Источник);
	Иначе 
		Сообщение = "Не удалось получить штрих-код!"	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗакрытияСканирования(ДополнительныеПараметры) Экспорт
	Возврат;
КонецПроцедуры